read_verilog -sv ./src/wrapper_gen.v
prep -top top_level
rename -top top_level
uniquify; hierarchy -check

write_rtlil ./out/nofault_gen.il
