read_verilog -sv ./src/wrapper_gen.v
prep -top wrapper
rename -top wrapper
uniquify; hierarchy -check

sim -zinit -clock clock_i -resetn reset_i -n 10 -rstlen 1 -w -vcd ./out/parse.vcd
select -module wrapper i:reset_i
delete -input; setundef -undriven -one
select -clear;

write_rtlil ./out/wrapper_gen.il
